# #+SETUPFILE: ~/Dropbox/org-minimal-html-theme/org-minimal-theme.setup
# #+LaTeX_CLASS: beamer
# #+LaTeX_CLASS_OPTIONS: [presentation]
# #+BEAMER_THEME: Berkeley
# #+COLUMNS: %45ITEM %10BEAMER_env(Env) %10BEAMER_act(Act) %4BEAMER_col(Col) %8BEAMER_opt(Opt)
# #+PROPERTY: BEAMER_col_ALL 0.1 0.2 0.3 0.4 0.5 0.6 0.7 0.8 0.9 0.0 :ETC
# #+BIND: org-latex-image-default-width 0.7\linewidth
# #+BIND: org-latex-image-default-height 0.7\linewidth
# #+PROPERTY: header-args:R :session *R*  :eval no-export :height 360 :width 360
# #+OPTIONS: tasks:nil
# #+OPTIONS: toc:nil
** Assessing what we need
   #+begin_src R :session :exports both
   ls()
   #+end_src

   #+RESULTS:
   | daily_data                 |
   | fix_price                  |
   | g                          |
   | generate_bootstrap_results |
   | l                          |
   | no_postcode_county         |
   | normalise_names            |
   | obj                        |
   | post_codes_table           |
   | postcode_county            |
   | ppr                        |
   | ppr_bootstrap_indices      |
   | ppr_not_train              |
   | ppr_test                   |
   | ppr_test_indices           |
   | ppr_train                  |
   | ppr_train_indices          |
   | ppr_train2                 |
   | ppr10                      |
   | ppr2                       |
   | ppr3                       |
   | ppr4                       |
   | ppr5                       |
   | ppr6                       |
   | ppr7                       |
   | ppr8                       |
   | ppr9                       |


- We have a bunch of dataframes, some functions and a few intermediate results
- However, the best *pinch point* is ppr_train and test, as they are
  downstream of all our feature engineering
